In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [6]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A -0.981312  2.854186 -0.867664  0.464549
B -1.649050 -1.357050 -0.205019  0.276337
C  0.847949  1.401675 -1.758419  0.066553
D  0.244302  0.066007 -0.846044  0.525563
E -0.394880 -1.563112 -0.265559  0.738181

In [8]:
df['W']

A   -0.981312
B   -1.649050
C    0.847949
D    0.244302
E   -0.394880
Name: W, dtype: float64

In [11]:
df[['W','Z']]

          W         Z
A -0.981312  0.464549
B -1.649050  0.276337
C  0.847949  0.066553
D  0.244302  0.525563
E -0.394880  0.738181

In [9]:
df.loc['A']

W   -0.981312
X    2.854186
Y   -0.867664
Z    0.464549
Name: A, dtype: float64

In [10]:
df.iloc[0]

W   -0.981312
X    2.854186
Y   -0.867664
Z    0.464549
Name: A, dtype: float64

In [12]:
df['new'] = df['W'] + 5

In [13]:
df

          W         X         Y         Z       new
A -0.981312  2.854186 -0.867664  0.464549  4.018688
B -1.649050 -1.357050 -0.205019  0.276337  3.350950
C  0.847949  1.401675 -1.758419  0.066553  5.847949
D  0.244302  0.066007 -0.846044  0.525563  5.244302
E -0.394880 -1.563112 -0.265559  0.738181  4.605120

In [14]:
df.drop('new', axis=1, inplace=True)

In [15]:
df

          W         X         Y         Z
A -0.981312  2.854186 -0.867664  0.464549
B -1.649050 -1.357050 -0.205019  0.276337
C  0.847949  1.401675 -1.758419  0.066553
D  0.244302  0.066007 -0.846044  0.525563
E -0.394880 -1.563112 -0.265559  0.738181

In [17]:
df.loc['A','W']

-0.98131204717066522

In [18]:
df.loc[['A','B'], ['W','X']]

          W         X
A -0.981312  2.854186
B -1.649050 -1.357050

# Multi Index

In [4]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [6]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [10]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [11]:
df

             A         B
G1 1  1.022948 -0.230619
   2  0.753914 -1.177435
   3 -1.643079 -0.219445
G2 1  0.951251 -0.041247
   2 -0.400898 -0.434137
   3  1.152536  0.614060

In [12]:
df.loc['G1']

          A         B
1  1.022948 -0.230619
2  0.753914 -1.177435
3 -1.643079 -0.219445

In [13]:
df.loc['G1'].loc[2].B

-1.1774346111930529

In [16]:
df.index.names = ['group','num']

In [17]:
df

                  A         B
group num
G1    1    1.022948 -0.230619
      2    0.753914 -1.177435
      3   -1.643079 -0.219445
G2    1    0.951251 -0.041247
      2   -0.400898 -0.434137
      3    1.152536  0.614060

In [19]:
#針對某一層 index取值
df.xs(1,level='num')

              A         B
group
G1     1.022948 -0.230619
G2     0.951251 -0.041247

# Missing Data

In [20]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [21]:
df = pd.DataFrame(d)

In [22]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [23]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [24]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [25]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [26]:
df.fillna(value='value')

       A      B  C
0      1      5  1
1      2  value  2
2  value  value  3

In [28]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group By

In [3]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
byComp = df.groupby('Company')

In [7]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [8]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [9]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [12]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merge, Join, and Concate

In [13]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [14]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [15]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [16]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [17]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [18]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [19]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [20]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [23]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [24]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [26]:
pd.merge(left,right,how='outer',on=['key1','key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

Merge 是根據指定 colume做 merge, Join 是根據 index.

In [27]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [30]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [2]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df[(df['col1']>2) & (df['col1']==3)]

   col1  col2 col3
2     3   666  ghi

In [9]:
def times2(x):
    return x*2

In [10]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64